# This no-look `asgn` rule is different from the `_ -> asgn` I was planning.
# This version can fall back to a different rule. The hypothetical blank-match
# version cannot, since that match always succeeds.
rule simple_stmt choices:
| "var" -> decl
| int_value -> error 'Statement cannot start with a number'
| asgn
| error 'Invalid statement'

# TODO Allow the use of literal strings in optional brackets, like
# "[ this ]", where 'this' is not a template part.
rule decl:
  var ident [ = int_value ]
outputs: {
  stmt: "decl",
  varname: ident,
  init_value: int_value,
}

rule ident_regex: /[_a-zA-Z]+/
rule int_value: /-?[0-9]+/

# TODO non-word inline lookaheads
rule ident choices:
| "var" -> error 'Reserved keyword "var" cannot be a variable name'
| ident_regex

rule asgn:
  ident = int_value
outputs: {
  stmt: "asgn",
  lhs: ident,
  rhs: int_value,
}

example simple_stmt:
  var x = 5
outputs: {
  stmt: "decl",
  varname: "x",
  init_value: "5",
}

# No initial value
example simple_stmt:
  var x
outputs: {
  stmt: "decl",
  varname: "x",
  init_value: {},
}

example simple_stmt:
  x = 5
outputs: {
  stmt: "asgn",
  lhs: "x",
  rhs: "5",
}

example simple_stmt:
  varx = 5
outputs: {
  stmt: "asgn",
  lhs: "varx",
  rhs: "5",
}

example simple_stmt:
  4: varx = 5;
outputs error with 'Statement cannot start with a number'

example simple_stmt:
  (lisp s-expression)
outputs error with 'Invalid statement'

example decl:
  var var = 5
outputs error with 'Reserved keyword "var" cannot be a variable name'

# TODO success test with end-position marker, like codegen ignored tests.

rule simple_stmt_flipped choices:
| asgn_quiet
| "var" -> decl

rule asgn_quiet choices:
| "var" -> quiet error
| asgn

example simple_stmt_flipped:
  var x = 5
outputs: { stmt: "decl", varname: "x", init_value: "5" }

example simple_stmt_flipped:
  x = 5
outputs: { stmt: "asgn", lhs: "x", rhs: "5" }

# TODO ellipsis shouldn't have to be surrounded by spaces.
# TODO ellipsis in output template. E.g. [simple_stmt, ...].
rule compound_stmt:
  simple_stmt; ... ; simple_stmt;
outputs: { stmt: [simple_stmt, ...] }

example compound_stmt:
  x = 3;
  var y = 9;
outputs: {
  stmt: [
    { stmt: "asgn", lhs: "x", rhs: "3" },
    { stmt: "decl", varname: "y", init_value: "9" },
  ]
}
